---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.FlowAndPressureCalculationMethodHasBeenImproved
source: html/68dde6ef-ad0a-e53c-b0ce-3a4061528c5f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.FlowAndPressureCalculationMethodHasBeenImproved Property

During upgrade pressure drop calculations for hydronic piping systems using Simplified Colebrook or Custom Calculation methods have been recalculated using the Colebrook equation.

## Syntax (C#)
```csharp
public static FailureDefinitionId FlowAndPressureCalculationMethodHasBeenImproved { get; }
```